{
    "meta": {
        "name": "العربية (AR)"
    },
    "strings": {
        "pageTitle": "الإعداد- jfa-go",
        "next": "التالي",
        "back": "الخلف",
        "optional": "اختياري",
        "serverType": "نوع الخادم",
        "disabled": "معطّل",
        "enabled": "مفعّل",
        "port": "المنفذ",
        "message": "الرسالة",
        "serverAddress": "عنوان الخادم",
        "emailSubject": "موضوع البريد الإلكتروني",
        "URL": "رابط",
        "apiKey": "مفتاح API",
        "error": "خطأ",
        "errorInvalidUserPass": "اسم مستخدم/كلمة مرور خاطئة.",
        "errorNotAdmin": "لا يُسمح للمستخدم بإدارة الخادم.",
        "errorUserDisabled": "قد يكون المستخدم معطلاً.",
        "error404": "404، تحقق من عنوان URL الداخلي.",
        "errorConnectionRefused": "رُفض الاتصال.",
        "errorUnknown": "خطأ غير معروف، تحقق من سجلات التطبيق.",
        "errorProxy": "إعدادات الوكيل غير صالحة."
    },
    "startPage": {
        "welcome": "مرحباً!",
        "pressStart": "ستحتاج إلى القيام ببعض الخطوات لإعداد jfa-go. اضغط على \"ابدأ\" للمتابعة.",
        "httpsNotice": "تأكد من الاتصال بهذه الصفحة عبر HTTPS أو على شبكة خاصة.",
        "start": "ابدأ"
    },
    "endPage": {
        "finished": "انتهينا!",
        "restartMessage": "",
        "refreshPage": "تحديث",
        "moreFeatures": "يمكنك العثور على المزيد من الميزات مثل بوتات Discord/Telegram/Matrix ورسائل ترميز Markdown المخصصة في الإعدادات، لذا تأكد من تصفحها.",
        "restartReload": "اضغط أدناه لإعادة التشغيل، ثم قم بالدخول إلى jfa-go من أحد عناوين URL الداخلية/الخارجية المحددة.",
        "ifFailedLoad": "إذا لم يتم تحميل الصفحة، فتحقق من سجلات التطبيق بحثاً عن أي أدلة تشير إلى السبب."
    },
    "language": {
        "title": "اللغة",
        "description": "تتوفر ترجمات تطوعية لمعظم أجزاء jfa-go. يمكنك اختيار اللغات الافتراضية أدناه، ويمكن للمستخدمين تغييرها إذا رغبوا في ذلك. إذا أردت المساعدة في الترجمة، قم بالتسجيل في {n} للمساهمة!",
        "defaultAdminLang": "لغة المسؤول الافتراضية",
        "defaultFormLang": "لغة إنشاء الحساب الافتراضية",
        "defaultEmailLang": "لغة البريد الافتراضية"
    },
    "general": {
        "title": "عام",
        "listenAddress": "عنوان الاستماع",
        "urlBase": "عنوان URL الأساسي",
        "urlBaseNotice": "مطلوب فقط في حالة استخدام وكيل عكسي على مجلد فرعي (على سبيل المثال 'jellyf.in/accounts').",
        "lightTheme": "فاتح",
        "darkTheme": "داكن",
        "useHTTPS": "استخدم HTTPS",
        "httpsPort": "منفذ HTTPS",
        "useHTTPSNotice": "موصى به فقط في حال عدم استخدامك لوكيل عكسي.",
        "pathToCertificate": "مسار الشهادة",
        "pathToKeyFile": "مسار ملف المفتاح ‎(.key)",
        "externalURLNotice": "عنوان URL المستخدم للوصول إلى jfa-go. يُستخدم لإنشاء روابط لأمور مثل إعادة تعيين كلمة المرور. تأكد من تضمين عنوان URL الأساسي أعلاه إذا قمت بتعيينه.",
        "externalURL": "عنوان URL الخارجي لـ jfa-go"
    },
    "updates": {
        "title": "التحديثات",
        "description": "تلقي إشعارات عند توفر تحديثات جديدة. سيتحقق jfa-go من {n} كل 30 دقيقة. لا يتم جمع أي عناوين IP أو معلومات شخصية.",
        "updateChannel": "قناة التحديثات",
        "stable": "مستقرة",
        "unstable": "غير مستقرة"
    },
    "login": {
        "title": "تسجيل الدخول",
        "description": "للوصول إلى صفحة المسؤول، سجّل الدخول بإحدى الطرق التالية:",
        "authorizeWithJellyfin": "التفويض باستخدام Jellyfin/Emby: يتم مشاركة تفاصيل تسجيل الدخول مع Jellyfin، مما يسمح بتعدد المستخدمين.",
        "authorizeManual": "اسم المستخدم وكلمة المرور: قم بتعيين اسم المستخدم وكلمة المرور يدوياً.",
        "adminOnly": "المسؤولون فقط (مستحسن)",
        "allowAll": "السماح لجميع مستخدمي Jellyfin بتسجيل الدخول",
        "allowAllDescription": "لا يُنصح بذلك، ينبغي السماح للمستخدمين الفرديين بتسجيل الدخول بعد الإعداد.",
        "emailNotice": "يمكن استخدام عنوان بريدك الإلكتروني لتلقي الإشعارات.",
        "authorizeManualUserPageNotice": "سيؤدي استخدام هذا إلى تعطيل ميزة \"صفحة المستخدم\"."
    },
    "jellyfinEmby": {
        "title": "إعداد Jellyfin/Emby",
        "description": "يلزم وجود حساب مسؤول لأن واجهة برمجة التطبيقات (API) لا تسمح بإنشاء مستخدمين من خلالها. يجب عليك إنشاء حساب منفصل وتحديد خيار \"اسمح لهذا المستخدم بالتحكم بالخادم\". يمكنك تعطيل كل الخيارات الأخرى. بعد ذلك، أدخل بيانات تسجيل الدخول هنا.",
        "embyNotice": "دعم Emby محدود ولا يدعم إعادة تعيين كلمة المرور.",
        "internal": "داخلي",
        "external": "خارجي",
        "replaceJellyfin": "اسم الخادم",
        "replaceJellyfinNotice": "عند إدخاله، سيحل هذا الاسم محل أي ذكر لكلمة \"Jellyfin\" في التطبيق.",
        "addressExternalNotice": "اتركه فارغاً لاستخدام نفس العنوان.",
        "testConnection": "اختبر الاتصال"
    },
    "ombi": {
        "title": "إعداد Ombi",
        "description": "عند الاتصال بـ Ombi، سيتم إنشاء حساب Jellyfin و Ombi عندما ينضم المستخدم عبر jfa-go. بعد الانتهاء من الإعداد، انتقل إلى الإعدادات لتعيين ملف تعريف افتراضي لمستخدمي Ombi الجدد.",
        "apiKeyNotice": "تجده في أول قسم لإعدادات Ombi.",
        "stabilityWarning": "تحذير: تكامل Ombi غير مستقر، وقد يُسبب مشاكل. يُنصح باستخدام Jellyseerr بدلاً منه. راجع {n} لمزيد من المعلومات."
    },
    "messages": {
        "title": "الرسائل",
        "description": "يُمكن لـ jfa-go إرسال عمليات إعادة تعيين كلمة المرور ورسائل مُختلفة عبر البريد الإلكتروني، ‎،Discord ،Telegram و/أو Matrix. ‏يُمكنك إعداد البريد الإلكتروني أدناه، ويُمكنك ضبط باقي الخيارات لاحقاً في الإعدادات. يُمكنك الاطلاع على التعليمات في {n}. إذا لم تكن بحاجة إلى هذه الميزة، فيُمكنك تعطيلها هنا."
    },
    "email": {
        "title": "البريد الإلكتروني",
        "description": "يُمكن لـ jfa-go إرسال رموز (PIN) لإعادة تعيين كلمة المرور وإرسال إشعارات متنوعة عبر البريد الإلكتروني. يُمكنك الاتصال بخادم SMTP أو استخدام واجهة برمجة التطبيقات (API) لـ{n}.",
        "method": "وسيلة الإرسال",
        "useEmailAsUsername": "استخدم عناوين البريد الإلكتروني كاسم المستخدم",
        "useEmailAsUsernameNotice": "عند التفعيل، فسيقوم المستخدمون الجدد بتسجيل الدخول إلى Jellyfin/Emby باستخدام عنوان بريدهم الإلكتروني بدلاً من اسم المستخدم.",
        "fromAddress": "عنوان المرسل",
        "senderName": "اسم المرسل",
        "dateFormat": "صيغة التاريخ",
        "dateFormatNotice": "التاريخ يتبع تنسيق strftime. لمزيد من المعلومات، يرجى بزيارة {n}.",
        "encryption": "التشفير",
        "mailgunApiURL": "رابط API"
    },
    "notifications": {
        "title": "إشعارات المسؤول",
        "description": "عند التفعيل، ستتلقى رسالة لكل دعوة عند انتهاء صلاحيتها او عند انشاء مستخدم من خلالها. إذا لم تختر طريقة تسجيل الدخول عبر Jellyfin، فتأكد من تقديم عنوان بريدك الإلكتروني أو أضف وسيلة اتصال أخرى لاحقاً."
    },
    "welcomeEmails": {
        "title": "رسائل الترحيب",
        "description": "عند التفعيل، فسيتم إرسال رسالة إلى المستخدمين الجدد تحتوي على عنوان URL لـ Jellyfin/Emby واسم المستخدم الخاص بهم."
    },
    "inviteEmails": {
        "title": "رسائل الدعوة",
        "description": "عند التفعيل، يمكنك إرسال الدعوات مباشرةً إلى بريد المستخدم الإلكتروني، أو إلى مستخدم Discord أو Matrix. ولأنك قد تستخدم وكيل عكسي، يجب عليك تحديد عنوان URL الذي تصل إليه الدعوات. اكتب عنوان URL الأساسي، وأضف '‎/invite'."
    },
    "passwordResets": {
        "title": "عمليات إعادة تعيين كلمة المرور",
        "description": "عندما يحاول مستخدم إعادة تعيين كلمة مروره، يُنشئ Jellyfin ملفاً باسم 'passwordreset-*.json' يحتوي على رمز (PIN). يقرأ jfa-go الملف ويرسل الرمز (PIN) إلى المستخدم. إذا قمت بتفعيل ميزة \"صفحة المستخدم\"، فيمكن أيضاً إجراء إعادة التعيين هناك، باستخدام اسم المستخدم أو البريد الإلكتروني أو وسيلة الاتصال.",
        "pathToJellyfin": "مسار مجلد تكوين Jellyfin (config)",
        "pathToJellyfinNotice": "إذا كنت لا تعرف مكان المسار، فحاول إعادة تعيين كلمة مرورك في Jellyfin. ستظهر نافذة منبثقة تحتوي على \"‎<path to jellyfin>/passwordreset-*.json\". هذا ليس ضروريًا إذا كنت ترغب فقط في استخدام خدمة إعادة تعيين كلمة المرور الذاتية من خلال \"صفحة المستخدم\".",
        "resetLinks": "أرسل رابطاً بدلاً من رمز (PIN)",
        "resetLinksNotice": "إذا تم إعداد Ombi، فاستخدم هذا لمزامنة إعادة تعيين كلمة مرور Jellyfin مع Ombi.",
        "resetLinksLanguage": "لغة رابط إعادة التعيين الافتراضية",
        "setPassword": "تعيين كلمة المرور من خلال رابط",
        "setPasswordNotice": "تفعيل هذه الميزة يعني أن المستخدم لن يضطر إلى تغيير كلمة المرور من الرمز (PIN) بعد إعادة التعيين. سيتم أيضاً فرض متطلبات كلمة المرور.",
        "moreInfo": "يمكنك العثور على مزيد من المعلومات حول الطرق المختلفة لإعادة تعيين كلمات المرور على {n}.",
        "resetLinksRequiredForUserPage": "مطلوب للسماح بإعادة تعيين كلمة المرور ذاتياً على صفحة المستخدم."
    },
    "passwordValidation": {
        "title": "متطلبات كلمة المرور",
        "description": "عند التفعيل، ستظهر مجموعة من متطلبات كلمة المرور على صفحة إنشاء الحساب، مثل الحد الأدنى لطول الكلمة، وعدد الأحرف الكبيرة/الصغيرة، وما إلى ذلك.",
        "length": "طول الكلمة",
        "uppercase": "عدد الأحرف الكبيرة",
        "lowercase": "عدد الأحرف الصغيرة",
        "numbers": "عدد الأرقام",
        "special": "عدد الحروف الخاصة (%, *, إلخ.)"
    },
    "helpMessages": {
        "title": "رسائل المساعدة",
        "description": "ستظهر هذه الرسائل في صفحة إنشاء الحساب وفي بعض رسائل البريد الإلكتروني.",
        "contactMessage": "رسالة الاتصال",
        "contactMessageNotice": "يتم عرضها في أسفل جميع الصفحات باستثناء صفحة المسؤول.",
        "helpMessage": "رسالة المساعدة",
        "helpMessageNotice": "يتم عرضها على صفحة إنشاء الحساب.",
        "successMessage": "رسالة النجاح",
        "successMessageNotice": "تظهر عندما يُتم المستخدم إنشاء حسابه.",
        "emailMessage": "رسالة البريد الإلكتروني",
        "emailMessageNotice": "تظهر في نهاية رسائل البريد الإلكتروني.",
        "markdownMessageNotice": "يمكن تخصيص محتويات بعض رسائل البريد الإلكتروني والصفحات والرسائل باستخدام ترميز Markdown في الإعدادات."
    },
    "jellyseerr": {
        "description": "Jellyseerr هو بديل لـ Ombi، ويتكامل مع jfa-go بشكل أفضل. بعد الانتهاء من الإعداد، انتقل إلى الإعدادات لإنشاء ملف تعريف وإضافة قالب لحسابات Jellyseerr الجديدة.",
        "title": "إعداد Jellyseerr",
        "importExisting": "استيراد المستخدمين الحاليين",
        "importExistingDescription": "عند التفعيل، سيتم مزامنة تفاصيل وسائل الاتصال والتفضيلات الخاصة بالمستخدمين الحاليين من jfa-go."
    },
    "proxy": {
        "title": "الوكيل",
        "description": "دع jfa-go يقوم بجميع الاتصالات من خلال وكيل HTTP/SOCKS5. سيتم اختبار الاتصال بـ Jellyfin من خلاله.",
        "protocol": "البروتوكول",
        "address": "العنوان (متضمناً المنفذ)"
    },
    "userPage": {
        "description": "تتيح صفحة المستخدم (التي تظهر باسم \"حسابي\") للمستخدمين الوصول إلى معلومات حسابهم، مثل وسائل الاتصال ومدة صلاحية الحساب. كما يمكنهم تغيير كلمة المرور، وطلب إعادة تعيينها ، وربط/تغيير وسائل الاتصال، دون الحاجة إلى طلب ذلك منك. بالإضافة إلى ذلك، يمكن عرض رسائل بترميز Markdown مخصصة للمستخدمين قبل وبعد تسجيل الدخول.",
        "title": "صفحة المستخدم",
        "customizeMessages": "اضغط زر التعديل بجوار \"صفحة المستخدم\" في الإعدادات لتعيينها لاحقاً.",
        "requiredSettings": "يجب تفعيل تسجيل الدخول إلى jfa-go عبر Jellyfin. تأكد من اختيار \"إعادة تعيين كلمة المرور عبر رابط\" لاحقاً للسماح بإعادة تعيين كلمة المرور ذاتياً."
    }
}
