{
    "meta": {
        "name": "Ελληνικά (GR)"
    },
    "strings": {
        "pageTitle": "Ρύθμιση - jfa-go",
        "next": "Επόμενο",
        "back": "Πίσω",
        "optional": "Προαιρετικό",
        "serverType": "Τύπος Server",
        "disabled": "Απενεργοποιημένο",
        "enabled": "Ενεργοποιημένο",
        "port": "Θύρα",
        "message": "Μήνυμα",
        "serverAddress": "Διεύθυνση Server",
        "emailSubject": "Θέμα Email",
        "URL": "URL",
        "apiKey": "Κλειδί API"
    },
    "startPage": {
        "welcome": "Καλωσήρθατε!",
        "pressStart": "Θα χρειαστεί να κάνετε μερικά πράγματα για να ρυθμίσετε το jfa-go. Πατήστε έναρξη για να συνεχίσετε.",
        "httpsNotice": "Βεβαιωθείτε ότι έχετε πρόσβαση σε αυτήν τη σελίδα μέσω HTTPS ή σε ιδιωτικό δίκτυο.",
        "start": "Έναρξη"
    },
    "endPage": {
        "finished": "Τέλος!",
        "restartMessage": "Υπάρχουν περισσότερες ρυθμίσεις που μπορείτε να διαμορφώσετε στη σελίδα διαχειριστή. Κάντε κλικ παρακάτω για επανεκκίνηση και στη συνέχεια ανανεώστε τη σελίδα.",
        "refreshPage": "Ανανέωση"
    },
    "language": {
        "title": "Γλώσσα",
        "description": "Οι μεταφράσεις κοινότητας είναι διαθέσιμες για τα περισσότερα μέρη του jfa-go. Μπορείτε να επιλέξετε τις προεπιλεγμένες γλώσσες παρακάτω, αλλά οι χρήστες μπορούν να τις αλλάξουν αν το επιθυμούν. Αν θέλετε να βοηθήσετε στη μετάφραση, εγγραφείτε στο {n} για να ξεκινήσετε να συνεισφέρετε!",
        "defaultAdminLang": "Προεπιλεγμένη γλώσσα διαχειριστή",
        "defaultFormLang": "Προεπιλεγμένη γλώσσα δημιουργίας λογαριασμού",
        "defaultEmailLang": "Προεπιλεγμένη γλώσσα email"
    },
    "general": {
        "title": "Γενικά",
        "listenAddress": "Διεύθυνση Παρακολούθησης",
        "urlBase": "URL Base",
        "urlBaseNotice": "Απαιτείται μόνο εάν χρησιμοποιείτε reverse proxy σε ένα subdomain (π.χ. «jellyf.in/accounts»).",
        "lightTheme": "Ανοιχτό",
        "darkTheme": "Σκούρο",
        "useHTTPS": "Χρήση HTTPS",
        "httpsPort": "Θύρα HTTPS",
        "useHTTPSNotice": "Συνιστάται μόνο εάν δεν χρησιμοποιείτε reverse proxy.",
        "pathToCertificate": "Διαδρομή πιστοποιητικού",
        "pathToKeyFile": "Διαδρομή αρχείου κλειδιού"
    },
    "login": {
        "title": "Σύνδεση",
        "description": "Για να αποκτήσετε πρόσβαση στη σελίδα διαχειριστή, πρέπει να συνδεθείτε με μια απο τις παρακάτω μεθόδους:",
        "authorizeWithJellyfin": "Εξουσιοδότηση με Jellyfin / Emby: Τα στοιχεία σύνδεσης κοινοποιούνται στο Jellyfin, το οποίο επιτρέπει πολλαπλούς χρήστες.",
        "authorizeManual": "Όνομα χρήστη και κωδικός πρόσβασης: Ορίστε μη αυτόματα το όνομα χρήστη και τον κωδικό πρόσβασης.",
        "adminOnly": "Μόνο διαχειριστές (συνιστάται)",
        "emailNotice": "Η διεύθυνση email σας μπορεί να χρησιμοποιηθεί για τη λήψη ειδοποιήσεων."
    },
    "jellyfinEmby": {
        "title": "Jellyfin/Emby",
        "description": "Απαιτείται λογαριασμός διαχειριστή επειδή το API δεν επιτρέπει τη δημιουργία χρηστών χρησιμοποιώντας ένα κλειδί API. Πρέπει να δημιουργήσετε έναν ξεχωριστό λογαριασμό και να επιλέξετε \"Να επιτρέπεται σε αυτόν τον χρήστη να διαχειρίζεται τον server\". Μπορείτε να απενεργοποιήσετε τα υπόλοιπα. Μόλις τελειώσετε, εισαγάγετε τα στοιχεία σύνδεσης εδώ.",
        "embyNotice": "Η υποστήριξη Emby είναι περιορισμένη και δεν υποστηρίζει επαναφορά κωδικού πρόσβασης.",
        "internal": "Εσωτερικός",
        "external": "Εξωτερικός",
        "replaceJellyfin": "Όνομα Server",
        "replaceJellyfinNotice": "Εάν δοθεί, αυτό θα αντικαταστήσει οποιαδήποτε εμφάνιση του «Jellyfin» στην εφαρμογή.",
        "addressExternalNotice": "Αφήστε κενό για να χρησιμοποιήσετε την ίδια διεύθυνση.",
        "testConnection": "Δοκιμή Σύνδεσης"
    },
    "ombi": {
        "title": "Ombi",
        "description": "Με τη σύνδεση στο Ombi, θα δημιουργηθεί ένας λογαριασμός Jellyfin και Ombi όταν ένας χρήστης συνδεθεί μέσω του jfa-go. Αφού ολοκληρώσετε τη ρύθμιση, μεταβείτε στις Ρυθμίσεις για να ορίσετε ένα προεπιλεγμένο προφίλ για νέους χρήστες ombi.",
        "apiKeyNotice": "Βρείτε το στην πρώτη καρτέλα των ρυθμίσεων Ombi."
    },
    "email": {
        "title": "Email",
        "description": "Το jfa-go μπορεί να στείλει PIN επαναφοράς κωδικού πρόσβασης και διάφορες ειδοποιήσεις μέσω email. Μπορείτε να συνδεθείτε σε έναν διακομιστή SMTP ή να χρησιμοποιήσετε το {n} API.",
        "method": "Μέθοδος αποστολής",
        "useEmailAsUsername": "Χρησιμοποιήστε τις διευθύνσεις email ως όνομα χρήστη",
        "useEmailAsUsernameNotice": "Εάν ενεργοποιηθεί, οι νέοι χρήστες θα συνδεθούν στο Jellyfin / Emby με τη διεύθυνση ηλεκτρονικού ταχυδρομείου τους αντί για το όνομα χρήστη.",
        "fromAddress": "Από τη διεύθυνση",
        "senderName": "Ονομα αποστολέα",
        "dateFormat": "Μορφή ημερομηνίας",
        "dateFormatNotice": "Η ημερομηνία ακολουθεί τη μορφή strftime. Για περισσότερες πληροφορίες, επισκεφτείτε το {n}.",
        "encryption": "Κρυπτογράφηση",
        "mailgunApiURL": "Διεύθυνση API"
    },
    "notifications": {
        "title": "Ειδοποιήσεις",
        "description": "Εάν είναι ενεργοποιημένη, μπορείτε να επιλέξετε (ανά πρόσκληση) για να λάβετε ένα email όταν λήξει μια πρόσκληση ή δημιουργηθεί ένας χρήστης. Εάν δεν επιλέξατε τη μέθοδο σύνδεσης Jellyfin, βεβαιωθείτε ότι δώσατε τη διεύθυνση email σας."
    },
    "welcomeEmails": {
        "title": "Emails καλωσορίσματος",
        "description": "Εάν είναι ενεργοποιημένο, ένα email θα σταλεί σε νέους χρήστες με το URL του Jellyfin / Emby και το όνομα χρήστη τους."
    },
    "inviteEmails": {
        "title": "Emails πρόσκλησης",
        "description": "Εάν είναι ενεργοποιημένη, μπορείτε να στείλετε προσκλήσεις απευθείας στη διεύθυνση email ενός χρήστη. Επειδή ενδέχεται να χρησιμοποιείτε reverse proxy, πρέπει να παρέχετε το URL απο όπου θα συνδεθούν. Γράψτε τη βάση URL και προσθέστε «/invite»."
    },
    "passwordResets": {
        "title": "Επαναφορά κωδικών πρόσβασης",
        "description": "Όταν ένας χρήστης προσπαθεί να επαναφέρει τον κωδικό πρόσβασής του, το Jellyfin δημιουργεί ένα αρχείο με το όνομα 'passwordreset - *. json' το οποίο περιέχει ένα PIN. Το jfa-go διαβάζει το αρχείο και στέλνει το PIN στον χρήστη.",
        "pathToJellyfin": "Διαδρομή προς τον φάκελο διαμόρφωσης Jellyfin",
        "pathToJellyfinNotice": "Εάν δεν ξέρετε πού βρίσκεται, δοκιμάστε να επαναφέρετε τον κωδικό πρόσβασής σας στο Jellyfin. Θα εμφανιστεί ένα αναδυόμενο παράθυρο με το <<path to jellyfin> / passwordreset - *. json '."
    },
    "passwordValidation": {
        "title": "Επικύρωση κωδικού πρόσβασης",
        "description": "Εάν είναι ενεργοποιημένο, ένα σύνολο απαιτήσεων κωδικού πρόσβασης θα εμφανίζεται στη σελίδα δημιουργίας λογαριασμού, όπως ελάχιστο μήκος, κεφαλαίοι / πεζοί χαρακτήρες κ.λπ.",
        "length": "Μήκος",
        "uppercase": "Κεφαλαίοι χαρακτήρες",
        "lowercase": "Πεζοί χαρακτήρες",
        "numbers": "Αριθμοί",
        "special": "Ειδικοί χαρακτήρες (%, * κ.λπ.)"
    },
    "helpMessages": {
        "title": "Μηνύματα βοήθειας",
        "description": "Αυτά τα μηνύματα θα εμφανίζονται στη σελίδα δημιουργίας λογαριασμού και σε ορισμένα email.",
        "contactMessage": "Μήνυμα επικοινωνίας",
        "contactMessageNotice": "Εμφανίζεται στο κάτω μέρος όλων των σελίδων εκτός από του διαχειριστή.",
        "helpMessage": "Μήνυμα βοήθειας",
        "helpMessageNotice": "Εμφανίζεται στη σελίδα δημιουργίας λογαριασμού.",
        "successMessage": "Μήνυμα επιτυχίας",
        "successMessageNotice": "Εμφανίζεται όταν ένας χρήστης δημιουργεί τον λογαριασμό του.",
        "emailMessage": "Μήνυμα Email",
        "emailMessageNotice": "Εμφανίζεται στο κάτω μέρος των email."
    },
    "updates": {
        "title": "Ενημερώσεις",
        "description": "Ενεργοποίηση ειδοποίησης όταν είναι διαθέσιμες νέες ενημερώσεις. Το jfa-go θα ελέγχει {n} κάθε 30 λεπτά. Δεν συλλέγονται IP ή προσωπικές πληροφορίες.",
        "updateChannel": "Κανάλι Ενημερώσεων",
        "stable": "Σταθερό",
        "unstable": "Ασταθές"
    }
}