{
    "meta": {
        "name": "Français (FR)"
    },
    "strings": {
        "pageTitle": "Installation - JFA-Go",
        "next": "Suivant",
        "back": "Retour",
        "optional": "Optionnel",
        "serverType": "Type de serveur",
        "disabled": "Désactiver",
        "enabled": "Activé",
        "port": "Port",
        "message": "Message",
        "serverAddress": "Adresse du serveur",
        "emailSubject": "Objet de l'e-mail",
        "URL": "URL",
        "apiKey": "Clé API",
        "errorUserDisabled": "L'utilisateur est peut-être désactivé.",
        "error404": "404, vérifiez l'URL interne.",
        "errorInvalidUserPass": "Nom d'utilisateur/mot de passe invalide.",
        "errorNotAdmin": "L'utilisateur n'est pas autorisé à gérer le serveur.",
        "errorConnectionRefused": "Connexion refusée.",
        "error": "Erreur",
        "errorUnknown": "Erreur inconnue, vérifier les logs de l'application."
    },
    "startPage": {
        "welcome": "Bienvenue !",
        "pressStart": "Vous devez effectuer quelques opérations pour installer jfa-go. Appuyez sur commencer pour continuer.",
        "httpsNotice": "Assurez-vous que vous soyez connecté en HTTPS à cette page ou via réseau privé.",
        "start": "Commencer"
    },
    "endPage": {
        "finished": "Terminé !",
        "restartMessage": "Vous pouvez configurer les bots Discord/Telegram/Matrix, personnaliser vos messages et plus encore dans Paramètres. Cliquez ci-dessous pour redémarrer, puis actualisez la page.",
        "refreshPage": "Rafraichir"
    },
    "language": {
        "title": "Langue",
        "description": "Des traductions communautaires sont disponibles pour la plupart des parties de jfa-go. Vous pouvez choisir les langues par défaut ci-dessous, mais les utilisateurs peuvent toujours les modifier s'ils le souhaitent. Si vous souhaitez aider à traduire, inscrivez-vous sur {n} pour commencer à contribuer !",
        "defaultAdminLang": "Langue administrateur par défaut",
        "defaultFormLang": "Langue par défaut lors d'une création de compte",
        "defaultEmailLang": "Langue par défaut des e-mails"
    },
    "general": {
        "title": "Général",
        "listenAddress": "Adresse d'écoute",
        "urlBase": "Base URL",
        "urlBaseNotice": "Nécessaire seulement si vous utilisez un reverse proxy sur un sous-domaine (ex : 'jellyf.in/accounts').",
        "lightTheme": "Clair",
        "darkTheme": "Sombre",
        "useHTTPS": "Utiliser HTTPS",
        "httpsPort": "Port HTTPS",
        "useHTTPSNotice": "Recommandé seulement si vous n'utilisez pas de reverse proxy.",
        "pathToCertificate": "Chemin du certificat",
        "pathToKeyFile": "Chemin du fichier clé"
    },
    "login": {
        "title": "S'identifier",
        "description": "Pour accéder à la page d'administrateur, vous devez vous connecter avec la méthode ci-dessous :",
        "authorizeWithJellyfin": "Autoriser avec Jellyfin/Emby : Les Informations de connexion sont partagées avec Jellyfin, ce qui permet plusieurs utilisateurs.",
        "authorizeManual": "Utilisateur et Mot de passe : Renseignez manuellement le nom d'utilisateur et le mot de passe.",
        "adminOnly": "Administrateurs seulement (recommandé)",
        "emailNotice": "Votre adresse e-mail peut être utilisée pour recevoir des notifications.",
        "allowAll": "Autoriser tous les utilisateurs de Jellyfin à se connecter",
        "allowAllDescription": "Non recommandé, vous devez autoriser individuellement les utilisateurs à se connecter une fois la configuration effectuée."
    },
    "jellyfinEmby": {
        "title": "Jellyfin/Emby",
        "description": "Un compte administrateur est requis car l'API ne permet pas la création d'utilisateur. Vous devez créer un compte séparément et cocher 'Autoriser cet utilisateur à gérer le serveur'. Vous pouvez désactiver tout le reste. Une fois créé, renseignez les informations d'identification ici.",
        "embyNotice": "Le support de Emby est limité et ne permet pas la réinitialisation de mot de passe.",
        "internal": "Interne",
        "external": "Externe",
        "replaceJellyfin": "Nom du serveur",
        "replaceJellyfinNotice": "Si renseigné, remplacera toutes les occurrences de 'Jellyfin' dans l'application.",
        "addressExternalNotice": "Laissez vide pour utiliser la même adresse.",
        "testConnection": "Test de connexion"
    },
    "ombi": {
        "title": "Ombi",
        "description": "En connectant Ombi, un compte Jellyfin et un compte Ombi seront créés lorsque l'utilisateur rejoindra via jfa-go. Après la fin de l'installation, allez dans les Paramètres pour définir un profil par défaut pour les nouveaux utilisateurs d'Ombi.",
        "apiKeyNotice": "Trouvez ceci dans le premier onglet des paramètres de Ombi."
    },
    "email": {
        "title": "E-mail",
        "description": "jfa-go peut envoyer un code PIN de réinitialisation du mot de passe et plusieurs notifications par e-mail. Vous pouvez vous connecter à un serveur SMTP, ou utiliser l'API de {n}.",
        "method": "Méthode d'envoi",
        "useEmailAsUsername": "Utilisez l'adresse e-mail comme nom d'utilisateur",
        "useEmailAsUsernameNotice": "Si activé, les nouveaux utilisateurs se connecteront à Jellyfin/Emby avec cette adresse e-mail au lieu du nom d'utilisateur.",
        "fromAddress": "Depuis l'adresse",
        "senderName": "Nom de l'envoyeur",
        "dateFormat": "Format de la date",
        "dateFormatNotice": "La date suis le format srtftime. Pour plus d'informations, consultez {n}.",
        "encryption": "Chiffrement",
        "mailgunApiURL": "URL de l'API"
    },
    "notifications": {
        "title": "Notifications d'administrateur",
        "description": "Si activé, vous pouvez choisir (par invitation) de recevoir un message lorsque l'invitation expire, ou lorsque l'utilisateur est créé. Si vous ne choisissez pas la méthode de connexion par Jellyfin, assurez-vous d'avoir fourni votre adresse e-mail ou un autre moyen de contact."
    },
    "welcomeEmails": {
        "title": "Messages de bienvenue",
        "description": "Si activé, un message sera envoyé aux nouveaux utilisateurs avec l'URL de Jellyfin/Emby et leur nom d'utilisateur."
    },
    "inviteEmails": {
        "title": "Messages d'invitation",
        "description": "Si activé, vous pouvez envoyer une invitation directement à l'adresse e-mail, le Discord ou Matrix de l'utilisateur. Parce que vous pourriez utiliser un reverse proxy, vous devez renseigner l'URL d'accès aux invitations. Renseignez votre Base URL et ajoutez '/invite'."
    },
    "passwordResets": {
        "title": "Réinitialisation de mot de passe",
        "description": "Lorsqu'un utilisateur essaie de réinitialiser son mot de passe, Jellyfin créé un fichier nommé 'passwordreset-*.json' qui contient le code PIN. jfa-go lit le fichier et envoie le code PIN à l'utilisateur.",
        "pathToJellyfin": "Chemin du dossier de configuration de Jellyfin",
        "pathToJellyfinNotice": "Si vous ne savez pas où c'est, essayez de réinitialiser votre mot de passe dans Jellyfin. Une popup avec '<path to jellyfin>/passwordreset-*.json' apparaitra.",
        "resetLinks": "Envoyer un lien plutôt qu'un PIN",
        "resetLinksNotice": "Si l'intégration est activée, utilisez ceci pour synchroniser les réinitialisations de mots de passe Jellyfin avec Ombi.",
        "resetLinksLanguage": "Langue du lien de réinitialisation par défaut",
        "setPassword": "Définir le mot de passe via le lien",
        "setPasswordNotice": "L'activation de cette option signifie que l'utilisateur n'a pas à modifier son mot de passe à partir du code PIN après la réinitialisation. La validation du mot de passe sera également appliquée."
    },
    "passwordValidation": {
        "title": "Validation du mot de passe",
        "description": "Si cette option est activée, un ensemble d'exigences de mot de passe s'affichera sur la page de création de compte, comme la longueur minimale, les majuscules/minuscules, etc.",
        "length": "Longueur",
        "uppercase": "Majuscules",
        "lowercase": "Minuscules",
        "numbers": "Nombres",
        "special": "Caractères spéciaux (%, *, etc.)"
    },
    "helpMessages": {
        "title": "Messages d'aide",
        "description": "Ces messages s'afficheront dans la page de création de compte et dans certains e-mails.",
        "contactMessage": "Message de contact",
        "contactMessageNotice": "S'affiche au bas de toutes les pages sauf administrateur.",
        "helpMessage": "Message d'aide",
        "helpMessageNotice": "S'affiche sur la page de création de compte.",
        "successMessage": "Message de réussite",
        "successMessageNotice": "S'affiche lorsqu'un utilisateur crée son compte.",
        "emailMessage": "Message de l'e-mail",
        "emailMessageNotice": "S'affiche au bas des e-mails."
    },
    "updates": {
        "title": "Mises à jour",
        "description": "Activez pour être averti lorsque de nouvelles mises à jour sont disponibles. jfa-go vérifiera {n} toutes les 30 minutes. Aucune adresse IP ou information personnellement identifiable n'est collectée.",
        "updateChannel": "Mettre à jour la chaîne",
        "stable": "Stable",
        "unstable": "Instable"
    },
    "messages": {
        "title": "Messages",
        "description": "jfa-go peut envoyer des réinitialisations de mot de passe et divers messages par e-mail, Discord, Telegram et/ou Matrix. Vous pouvez configurer l'e-mail ci-dessous, et les autres peuvent être configurés dans les paramètres plus tard. Les instructions se trouvent sur le {n}. Si vous n'en avez pas besoin, vous pouvez désactiver ces fonctionnalités ici."
    }
}
