{
    "meta": {
        "name": "Magyar (HU)"
    },
    "strings": {
        "pageTitle": "Telepítés - jfa-go",
        "next": "Következő",
        "back": "Vissza",
        "optional": "Opcionális",
        "serverType": "Szerver típus",
        "disabled": "Tiltva",
        "enabled": "Engedélyezve",
        "port": "Port",
        "message": "Üzenet",
        "serverAddress": "Szerver cím",
        "emailSubject": "E-mail tárgy",
        "URL": "URL",
        "apiKey": "API kulcs",
        "errorInvalidUserPass": "Érvénytelen felhasználónév / jelszó.",
        "errorNotAdmin": "A felhasználó számára nincs engedélyezve a szerver kezelése.",
        "errorUserDisabled": "Lehetséges, hogy a felhasználó le lett tiltva.",
        "error404": "404, ellenőrizze a belső URL-t.",
        "errorConnectionRefused": "Csatlakozás visszautasítva.",
        "error": "Hiba",
        "errorUnknown": "Váratlan hiba, ellenőrizd a napló fájlt.",
        "errorProxy": "Proxy beállítás érvénytelen."
    },
    "startPage": {
        "welcome": "Üdv!",
        "pressStart": "A jfa-go beállításához néhány dolgot el kell végezned. A folytatáshoz nyomd meg a kezdés gombot.",
        "httpsNotice": "Győződjön meg róla, hogy HTTPS-en vagy privát hálózaton keresztül éri el ezt az oldalt.",
        "start": "Kezdés"
    },
    "endPage": {
        "finished": "Kész!",
        "restartMessage": "",
        "refreshPage": "Újratöltés",
        "moreFeatures": "Rengeteg további funkció, mint például a Discord/Telegram/Matrix botok és az egyéni Markdown üzenetek, megtalálható a Beállításokban, ezért mindenképpen böngészd át őket.",
        "restartReload": "Kattints ide az újraindításhoz, majd a megadott belső/külső URL-címek egyikén nyisd meg a jfa-go alkalmazást.",
        "ifFailedLoad": "Ha nem töltődik be, ellenőrizd az alkalmazás naplóit, hogy miért."
    },
    "language": {
        "title": "Nyelv",
        "description": "A jfa-go legtöbb részéhez elérhetők közösségi fordítások. Az alábbiakban kiválaszthatod az alapértelmezett nyelveket, de a felhasználók továbbra is módosíthatják azokat, ha akarják. Ha szeretnél segíteni a fordításban, regisztrálj a {n}-re, hogy elkezdhesd a közreműködést!",
        "defaultAdminLang": "Alapártelmezett rendszergazda nyelv",
        "defaultFormLang": "Alapértelmezett fiók nyelv",
        "defaultEmailLang": "Alapértelmezett email nyelv"
    },
    "general": {
        "title": "Alap",
        "listenAddress": "Figyelő címe",
        "urlBase": "Alap URL",
        "urlBaseNotice": "Csak akkor szükséges, ha fordított proxyt használsz egy almappán (pl. 'jellyf.in/accounts').",
        "lightTheme": "Fényes",
        "darkTheme": "Sötét",
        "useHTTPS": "HTTPS használata",
        "httpsPort": "HTTPS Port",
        "useHTTPSNotice": "Csak akkor aljánlott ha fordított proxy-t használsz.",
        "pathToCertificate": "Tanúsítvány elérési útja",
        "pathToKeyFile": "Kulcs fájl elérési útja",
        "externalURLNotice": "Az URL, amelyről a jfa-go címhez fogsz hozzáférni. Linkek generálására szolgál, például jelszó-visszaállításhoz. Ha beállítottál egyet, feltétlenül add meg a fenti alap URL-t is.",
        "externalURL": "Külső jfa-go URL"
    },
    "updates": {
        "title": "Frissítések",
        "description": "Engedélyezd ha szeretnél értesítést az új frissítésekről. A jfa-go 30 percenként ellenőrzi a(z) {n} címet. Nem gyűjt IP-címeket vagy személyes adatokat.",
        "updateChannel": "Csatorna frissítése",
        "stable": "Stabil",
        "unstable": "Instabil"
    },
    "login": {
        "title": "Belépés",
        "description": "Az admin oldal eléréséhez az alábbi módszerrel kell bejelentkezned:",
        "authorizeWithJellyfin": "Bejelentkezés Jellyfin/Emby segítségével: A bejelentkezési adatok meg vannak osztva a Jellyfin-nel, ami több felhasználó létrehozását teszi lehetővé.",
        "authorizeManual": "Felhasználónév és Jelszó: Felhasználónév és jelszó manuális beállítása.",
        "adminOnly": "Csak rendszergazda felhasználók (ajánlott)",
        "allowAll": "Összes Jellyfin felhasználó belépéssének engedélyezése",
        "allowAllDescription": "Nem ajánlott, a beállítás után engedélyezni kell az egyes felhasználók bejelentkezését.",
        "emailNotice": "Az email címed értesítések fogadására lesz használva.",
        "authorizeManualUserPageNotice": "Ennek használata letiltja a „Felhasználói oldal” funkciót."
    },
    "jellyfinEmby": {
        "title": "Jellyfin/Emby",
        "description": "Egy adminisztrátori fiók szükséges, mivel az API nem engedélyezi a felhasználók létrehozását API-kulcs használatával. Létre kell hoznia egy külön fiókot, és engedélyeznie kell az „Ez a felhasználó kezelheti a szervert” beállítást. Minden mást letilthat. Ha ezt megtette, adja meg itt a hitelesítő adatait.",
        "embyNotice": "Az Emby támogatása korlátozott, és nem támogatja a jelszó-visszaállítást.",
        "internal": "Belső",
        "external": "Külső",
        "replaceJellyfin": "Szerver neve",
        "replaceJellyfinNotice": "Ha meg van adva, ez felülírja a 'Jellyfin' minden előfordulását az alkalmazásban.",
        "addressExternalNotice": "Hagyja üresen, ha ugyanazt a címet szeretnéd használni.",
        "testConnection": "Kapcsolat tesztelése"
    },
    "ombi": {
        "title": "Ombi",
        "description": "Az Ombihoz való csatlakozással Jellyfin és Ombi fiók is létrejön, amikor a felhasználó a jfa-go-n keresztül csatlakozik. A beállítás befejezése után lépjen a Beállítások menüpontra, hogy alapértelmezett profilt állítson be az új ombi-felhasználók számára.",
        "apiKeyNotice": "Ezt az Ombi beállítások első lapján találod.",
        "stabilityWarning": "Figyelmeztetés: Az Ombi integráció instabil, és problémákat okozhat. Helyette a Jellyseerr használata ajánlott. További információkért lásd: {n}."
    },
    "messages": {
        "title": "Üzenetek",
        "description": "A jfa-go jelszó-visszaállítási információkat és különféle üzeneteket tud küldeni e-mailben, Discordon, Telegramon és/vagy Matrixon keresztül. Az e-mailt alább állíthatod be, a többit pedig később a Beállításokban konfigurálhatod. Az utasításokat a {n} oldalon találod. Ha erre nincs szükséged, itt letilthatod ezeket a funkciókat."
    },
    "email": {
        "title": "Email",
        "description": "A jfa-go jelszó-visszaállító PIN-kódokat és különféle értesítéseket tud küldeni e-mailben. Csatlakozhatsz egy SMTP-kiszolgálóhoz, vagy használhatod az {n} API-t.",
        "method": "Küldési mód",
        "useEmailAsUsername": "Email cím használata fehasználónévnek",
        "useEmailAsUsernameNotice": "Ha engedélyezve van, az új felhasználók a Jellyfin/Emby rendszerbe felhasználónév helyett az e-mail címükkel jelentkeznek be.",
        "fromAddress": "Feladó címe",
        "senderName": "Küldő címe",
        "dateFormat": "Dátum formátuma",
        "dateFormatNotice": "A dátum az strftime formátumot követi. További információkért látogasson el a {n} oldalra.",
        "encryption": "Titkosítás",
        "mailgunApiURL": "API URL"
    },
    "notifications": {
        "title": "Rendszergazda értesítések",
        "description": "Ha engedélyezve van, meghívónként kiválaszthatod, hogy üzenetet kapj-e, amikor egy meghívó lejár, vagy amikor létrejön egy felhasználó. Ha nem a Jellyfin bejelentkezési módot választottad, győződj meg róla, hogy megadtad az e-mail címedet, vagy adj hozzá később egy másik kapcsolatfelvételi módot."
    },
    "welcomeEmails": {
        "title": "Üdvözlő üzenetek",
        "description": "Ha engedélyezve van, az új felhasználók üzenetben kapják meg a Jellyfin/Emby URL-címet és a felhasználónevüket."
    },
    "inviteEmails": {
        "title": "Meghívó üzenetek",
        "description": "Ha engedélyezve van, közvetlenül a felhasználó e-mail címére, Discord vagy Matrix felhasználóra küldhet meghívókat. Mivel fordított proxyt használhat, meg kell adnia azt az URL-címet, ahonnan a meghívók elérhetők. Írja be az URL-alapját, és fűzze hozzá a '/invite' részt."
    },
    "passwordResets": {
        "title": "Jelszó visszaállítás",
        "description": "Amikor egy felhasználó megpróbálja visszaállítani a jelszavát, a Jellyfin létrehoz egy „passwordreset-*.json” nevű fájlt, amely egy PIN-kódot tartalmaz. A jfa-go beolvassa a fájlt, és elküldi a PIN-kódot a felhasználónak. Ha engedélyezte a „Felhasználói oldal” funkciót, a visszaállítás ott is elvégezhető felhasználónév, e-mail cím vagy kapcsolatfelvételi mód megadásával.",
        "pathToJellyfin": "Jellyfin konfigurációs könyvtár elérési útja",
        "pathToJellyfinNotice": "Ha nem tudod, hol van ez, próbáld meg visszaállítani a jelszavadat a Jellyfinben. Megjelenik egy felugró ablak a következővel: '<jellyfin elérési útja>/passwordreset-*.json'. Ez nem szükséges, ha csak az önkiszolgáló jelszó-visszaállítást szeretnéd használni a \"Felhasználói oldalon\".",
        "resetLinks": "Link küldése PIN kód helyett",
        "resetLinksNotice": "Ha az Ombi integráció engedélyezve van, használja ezt a Jellyfin jelszó-visszaállítások Ombival való szinkronizálásához.",
        "resetLinksLanguage": "Alapértelmezett jelszó-visszaállítási nyelv",
        "setPassword": "Jelszó beállítás linken keresztül",
        "setPasswordNotice": "Ha engedélyezve van, a felhasználónak nem kell PIN-kóddal módosítania a jelszavát. Ez a jelszó-ellenőrzést is kikényszeríti.",
        "moreInfo": "A jelszavak visszaállításának különböző módjairól további információt a {n} oldalon talál.",
        "resetLinksRequiredForUserPage": "Szükséges az önkiszolgáló jelszó-visszaállításhoz a felhasználói oldalon."
    },
    "passwordValidation": {
        "title": "Jelszóérvényesítés",
        "description": "Ha engedélyezve van, a fiók létrehozási oldalán megjelennek a jelszóra vonatkozó követelmények, például a minimális hossz, a nagy- és kisbetűk stb.",
        "length": "Hossz",
        "uppercase": "Nagybetűs karakterek",
        "lowercase": "Kisbetűs karakterek",
        "numbers": "Számok",
        "special": "Speciális karakterek"
    },
    "helpMessages": {
        "title": "Súgóüzenetek",
        "description": "Ezek az üzenetek a fiók létrehozási oldalán és néhány e-mailben jelennek meg.",
        "contactMessage": "Kapcsolatfelvételi üzenet",
        "contactMessageNotice": "Az adminisztrációs oldal kivételével az összes oldal alján megjelenik.",
        "helpMessage": "Súgóüzenet",
        "helpMessageNotice": "A fiók létrehozási oldalán jelenik meg.",
        "successMessage": "Sikeres üzenet",
        "successMessageNotice": "Akkor jelenik meg, amikor a felhasználó létrehozza a fiókját.",
        "emailMessage": "Email üzenet",
        "emailMessageNotice": "Az e-mailek alján jelenik meg.",
        "markdownMessageNotice": "Egyes e-mailek, oldalak és üzenetek tartalma testreszabható a Markdown segítségével a beállításokban."
    },
    "jellyseerr": {
        "description": "A Jellyseerr az Ombi alternatívája, és jobban integrálódik a jfa-go-val. A beállítás befejezése után a Beállítások menüpontban hozz létre egy profilt, és adj hozzá egy sablont az új Jellyseerr fiókokhoz.",
        "title": "Jellyseerr",
        "importExisting": "Meglévő fiókok importálása",
        "importExistingDescription": "Ha engedélyezve van, a meglévő felhasználók elérhetőségi adatai és beállításai szinkronizálva lesznek a jfa-go rendszerből."
    },
    "userPage": {
        "description": "A felhasználói oldal („Fiókom” néven látható) lehetővé teszi a felhasználók számára, hogy hozzáférjenek a fiókjukkal kapcsolatos információkhoz, például a kapcsolatfelvételi módokhoz és a fiók lejáratához. Megváltoztathatják jelszavukat, jelszó-visszaállítást kezdeményezhetnek, és összekapcsolhatják/módosíthatják a kapcsolatfelvételi módokat anélkül, hogy megkérdeznék Önt. Ezenkívül személyre szabott Markdown-üzenetek jeleníthetők meg a felhasználóknak a bejelentkezés előtt és után.",
        "title": "Felhasználói oldal",
        "customizeMessages": "Kattintson a beállításokban a „Felhasználói oldal” melletti szerkesztés gombra a későbbi módosításhoz.",
        "requiredSettings": "A jfa-go-ba Jellyfinen keresztül történő bejelentkezést be kell állítani. Győződjön meg róla, hogy a „jelszó visszaállítása linken keresztül” lehetőség van kiválasztva később az önkiszolgáló jelszó-visszaállításhoz."
    },
    "proxy": {
        "title": "Proxy",
        "description": "A jfa-go minden kapcsolatot HTTP/SOCKS5 proxyn keresztül hozzon létre. A Jellyfinhez való csatlakozást ezen a proxyn keresztül fogja tesztelni.",
        "protocol": "Protokoll",
        "address": "Cím (Port-al együtt)"
    }
}
