{
    "meta": {
        "name": "Nederlands (NL)"
    },
    "strings": {
        "pageTitle": "Installatie - jfa-go",
        "next": "Volgende",
        "back": "Terug",
        "optional": "Optioneel",
        "serverType": "Servertype",
        "disabled": "Uitgeschakeld",
        "enabled": "Ingeschakeld",
        "port": "Poort",
        "message": "Bericht",
        "serverAddress": "Serveradres",
        "emailSubject": "Onderwerp e-mail",
        "URL": "URL",
        "apiKey": "API-sleutel",
        "errorInvalidUserPass": "Ongeldige gebruikersnaam/wachtwoord.",
        "errorUserDisabled": "De gebruiker kan uitgeschakeld zijn.",
        "error404": "404, controleer de interne URL.",
        "errorNotAdmin": "Gebruiker heeft geen beheersrechten.",
        "errorConnectionRefused": "Verbinding geweigerd.",
        "errorUnknown": "Onbekende fout, bekijk de logs.",
        "error": "Fout"
    },
    "startPage": {
        "welcome": "Welkom!",
        "pressStart": "Je moet een paar dingen doen om jfa-go te installeren. Druk op start om verder te gaan.",
        "httpsNotice": "Zorg ervoor dat je deze pagina bezoekt via HTTPS of een privénetwerk.",
        "start": "Start"
    },
    "endPage": {
        "finished": "Klaar!",
        "restartMessage": "Instellingen als Discord/Telegram/Matrix bots, aangepaste Markdown berichten, en een gebruiker-toegankelijke \"Mijn Account\" pagina zijn te vinden onder \"Instellingen\", dus kijk daar even rond. Klik hieronder om te herstarten, en ververs de pagina.",
        "refreshPage": "Verversen"
    },
    "language": {
        "title": "Taal",
        "description": "Er zijn gemeenschapsvertalingen beschikbaar voor de meeste onderdelen van jfa-go. Je kunt hieronder de standaardtaal instellen, maar gebruikers kunnen die aanpassen indien gewenst. Als je wilt helpen met vertalen, meld je dan aan bij {n} en begin met vertalen!",
        "defaultAdminLang": "Standaardtaal (beheer)",
        "defaultFormLang": "Standaardtaal aanmaken nieuwe account",
        "defaultEmailLang": "Standaardtaal (e-mails)"
    },
    "general": {
        "title": "Algemeen",
        "listenAddress": "Adres",
        "urlBase": "URL-basis",
        "urlBaseNotice": "Alleen nodig bij gebruik van reverse proxy op een subdomein (bijv. 'jellyf.in/accounts').",
        "lightTheme": "Licht",
        "darkTheme": "Donker",
        "useHTTPS": "Gebruik HTTPS",
        "httpsPort": "HTTPS poort",
        "useHTTPSNotice": "Alleen aanbevolen als je geen reverse proxy gebruikt.",
        "pathToCertificate": "Pad naar certificaat",
        "pathToKeyFile": "Pad naar sleutelbestand"
    },
    "login": {
        "title": "Inloggen",
        "description": "Om de beheerderspagina te openen moet je inloggen met één van onderstaande methodes:",
        "authorizeWithJellyfin": "Jellyfin/Emby authorisatie: Inloggegevens worden gedeeld met Jellyfin, meerdere gebruikers mogelijk.",
        "authorizeManual": "Gebruikersnaam en wachtwoord: Stel handmatig een gebruikersnaam en wachtwoord in.",
        "adminOnly": "Alleen beheerders (aanbevolen)",
        "emailNotice": "Je e-mailadres kan gebruikt worden om meldingen te ontvangen.",
        "allowAll": "Laat alle Jellyfin-gebruikers inloggen",
        "allowAllDescription": "Afgeraden, je kunt beter individuele gebruikers toegang geven na de setup.",
        "authorizeManualUserPageNotice": "Gebruik hiervan schakelt de \"Gebruikerspagina\" functie uit."
    },
    "jellyfinEmby": {
        "title": "Jellyfin/Emby",
        "description": "Er is een beheerdersaccount nodig, omdat via de API geen gebruikers aangemaakt kunnen worden. Maak een aparte account aan en vink 'Deze gebruiker kan de server beheren' aan. Alle andere rechten kunnen uitgeschakeld worden. Vul daarna hier de inloggegevens in.",
        "embyNotice": "Ondersteuning voor Emby is beperkt en ondersteunt geen wachtwoordresets.",
        "internal": "Intern",
        "external": "Extern",
        "replaceJellyfin": "Servernaam",
        "replaceJellyfinNotice": "Indien ingevuld wordt overal in de app het woord 'Jellyfin' hierdoor vervangen.",
        "addressExternalNotice": "Laat leeg om hetzelfde adres te gebruiken.",
        "testConnection": "Test verbinding"
    },
    "ombi": {
        "title": "Ombi",
        "description": "Bij verbinding met Ombi, wordt voor nieuwe gebruikers via jfa-go zowel een Jellyfin als een Ombi account aangemaakt. Ga nadat de setup voltooid is naar instellingen om een standaardprofiel voor nieuwe Ombi-gebruikers te kiezen.",
        "apiKeyNotice": "Te vinden op het eerste tabblad van de Ombi-instellingen."
    },
    "email": {
        "title": "E-mail",
        "description": "jfa-go kan wachtwoord reset pincodes en meldingen via e-mail versturen. Je kunt verbinding maken met een SMTP server, of de {n} API gebruiken.",
        "method": "Verstuurmethode",
        "useEmailAsUsername": "Gebruik e-mailadres als gebruikersnaam",
        "useEmailAsUsernameNotice": "Indien ingeschakeld wordt voor nieuwe Jellyfin/Emby-gebruikers hun e-mailadres in plaats van gebruikersnaam gebruikt.",
        "fromAddress": "Afzenderadres",
        "senderName": "Naam afzender",
        "dateFormat": "Datumformaat",
        "dateFormatNotice": "Datum volgend het strftime formaat. Meer info op {n}.",
        "encryption": "Versleuteling",
        "mailgunApiURL": "API-URL"
    },
    "notifications": {
        "title": "Beheersmeldingen",
        "description": "Indien ingeschakeld kun je er (per uitnodiging) voor kiezen om een bericht te ontvangen wanneer een uitnodiging verloopt of er een gebruiker wordt aangemaakt. Als je niet inlogt via Jellyfin, controleer dan dat je je e-mailadres hebt ingevuld, of voeg later een andere contactmethode toe."
    },
    "welcomeEmails": {
        "title": "Welkomstberichten",
        "description": "Indien ingeschakeld wordt er een bericht gestuurd aan nieuwe gebruikers met de Jellyfin/Emby-URL en hun gebruikersnaam."
    },
    "inviteEmails": {
        "title": "Uitnodigingsbericht",
        "description": "Indien ingeschakeld kun je uitnodigingen direct naar het e-mailadres, Discord- of Matrix-account van gebruikers sturen. Omdat je misschien een reverse proxy gebruikt moet je het URL opgeven waarlangs uitnodigingen geopend worden. Geef de URL-basis op, gevolgd door '/invite'."
    },
    "passwordResets": {
        "title": "Wachtwoordresets",
        "description": "Wanneer een gebruiker een wachtwoordreset aanvraagt, maakt Jellyfin een bestand aan dat 'passwordreset-*.json' heet en een pincode bevat. jfa-go leest dit bestand uit en stuurt de pincode naar de gebruiker. Als je de \"Gebruikerspagina\" functionaliteit inschakelt, kan een reset ook daar worden gedaan aan de hand van een gebruikersnaam, e-mail, of contactmethode.",
        "pathToJellyfin": "Pad naar Jellyfin configuratiemap",
        "pathToJellyfinNotice": "Als je niet weet waar dit is, probeer de je wachtwoord te resetten in Jellyfin. Er verschijnt dan een popup met '<path to jellyfin>/passwordreset-*.json'. Dit is niet nodig als je alleen zelfzervice wachtwoordresets via de \"Gebruikerspagina\" wilt gebruiken.",
        "resetLinks": "Stuur een link in plaats van een pincode",
        "resetLinksNotice": "Als Ombi-integratie is ingeschakeld, gebruik dan dit om Jellyfin wachtwoordresets te synchroniseren met Ombi.",
        "resetLinksLanguage": "Standaard reset-link taal",
        "setPassword": "Stel wachtwoord in via link",
        "setPasswordNotice": "Als dit aanstaat hoeft de gebruiker het wachtwoord niet te wijzigen van de PINcode na de reset. Wachtwoordvalidatie wordt ook afgedwongen.",
        "resetLinksRequiredForUserPage": "Nodig voor zelfservice wachtwoordreset op de gebruikerspagina."
    },
    "passwordValidation": {
        "title": "Wachtwoordvalidatie",
        "description": "Indien ingeschakeld worden er op de account-aanmaakpagina een aantal wachtwoordvereisten getoond, zoals minimumlengte, hoofd-/kleine letters, enz.",
        "length": "Lengte",
        "uppercase": "Hoofdletters",
        "lowercase": "Kleine letters",
        "numbers": "Cijfers",
        "special": "Bijzondere tekens (%, *, etc.)"
    },
    "helpMessages": {
        "title": "Uitleg",
        "description": "Deze teksten worden getoond bij de account-aanmaakpagina en in sommige e-mails.",
        "contactMessage": "Contacttekst",
        "contactMessageNotice": "Getoond onderaan elke pagina behalve beheer.",
        "helpMessage": "Helpbericht",
        "helpMessageNotice": "Getoond op de account-aanmaakpagina.",
        "successMessage": "Succesbericht",
        "successMessageNotice": "Getoond wanneer een gebruiker een account aanmaakt.",
        "emailMessage": "E-mailtext",
        "emailMessageNotice": "Getoond onderaan e-mails."
    },
    "updates": {
        "unstable": "Instabiel",
        "updateChannel": "Update kanaal",
        "stable": "Stabiel",
        "title": "Updates",
        "description": "Vink aan om een melding te krijgen wanneer nieuwe updates beschikbaar zijn. jfa-go controleert {n} elke 30 minuten. Er worden geen IPs of persoonsgegevens verzameld."
    },
    "messages": {
        "title": "Berichten",
        "description": "jfa-go kan wachtwoordresets en verschillende berichten sturen via E-mail, Discord, Telegram, en/of Matrix. Je kunt e-mail hieronder instellen, en de rest kan later bij Instellingen aangepast worden. Instructies staan op de {n}. Als je dit niet nodig hebt, kun je deze onderdelen hier uitschakelen."
    },
    "userPage": {
        "description": "De gebruikerspagina (getoond als \"Mijn account\") geeft gebruikers toegang tot informatie over hun account, zoals contactmethodes en verloopdatum. Ze kunnen ook hun wachtwoord wijzigen, een wachtwoord-reset starten, en contactmethodes koppelen/wijzigen zonder het jou te hoeven vragen. Bovendien kunnen aanpasbare MArkdown berichten worden getoond aan gebruikers voor en na het inloggen.",
        "title": "Gebruikerspagina",
        "customizeMessages": "Gebruik de bewerken knop naast \"Gebruikerspagina\" in de instellingen om dit later in te stellen.",
        "requiredSettings": "Inloggen bij jfa-go via Jellyfin moet ingesteld zijn. Controleer dat \"reset wachtwoord via link\" later wordt gekozen voor zelfservice wachtwoord-resets."
    }
}
